{
  "backend/main.mo": "Motoko canister defining profiles, posts, comments, reactions, and moderation with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing key frontend files, pages, hooks, and components.",
  "frontend/index.css": "Tailwind CSS base/theme variable definitions with OKLCH color tokens for light and dark mode.",
  "frontend/index.html": "Basic HTML shell mounting the React app with the main script entry.",
  "frontend/src/App.tsx": "App router configuration using TanStack Router with lazy‑loaded pages including the GoldWaterTrackerPage.",
  "frontend/src/components/admin/AuthorName.tsx": "Displays a username for a principal via query, falling back to a shortened principal when missing.",
  "frontend/src/components/admin/FlaggedPostsPanel.tsx": "Admin panel listing auto‑flagged posts with filters, sorting, and flag‑clearing actions.",
  "frontend/src/components/admin/ReportedCommentsPanel.tsx": "Admin panel listing reported comments with actions to clear reports or delete comments.",
  "frontend/src/components/admin/ReportedPostsPanel.tsx": "Admin panel for viewing reported posts and allowing report clearing or post deletion.",
  "frontend/src/components/age/AgeAcknowledgementGate.tsx": "Displays an 18+ confirmation dialog for age‑gated routes and blocks access until acknowledged.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth, query cache clearing, and age‑gate reset.",
  "frontend/src/components/comments/CommentItem.tsx": "Renders a single comment with reporting and reaction actions plus error handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Top‑level layout with navigation, gates, and performance markers wrapping the app content.",
  "frontend/src/components/layout/MobileNav.tsx": "Slide‑in mobile navigation menu showing links based on auth and admin status.",
  "frontend/src/components/moderation/ModerationAlert.tsx": "Simple styled alert component for moderation warnings.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a post card with media, reactions, reporting, and deletion logic, handling navigation and errors for each action.",
  "frontend/src/components/profile/ProfileGate.tsx": "Shows a profile setup dialog for new authenticated users and saves basic profile info including adult confirmation.",
  "frontend/src/components/reactions/ReactionBar.tsx": "Renders reaction buttons with icons, selection state, pending handling, and click callbacks.",
  "frontend/src/components/state/QueryState.tsx": "Provides generic UI components for loading skeletons, error messages, empty states, and background refresh indicators.",
  "frontend/src/components/state/RouteChunkLoading.tsx": "Displays a centered spinner and message while route-based code chunks are loading.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useBackendExternalBlobUrl.ts": "Converts ExternalBlob video data into accessible URLs, preferring direct URLs and managing object URL cleanup.",
  "frontend/src/hooks/useBackendImageUrl.ts": "Converts ExternalBlob image data into browser-safe URLs using direct links or generated object URLs with cleanup.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns current identity details and fetches the caller's user profile with status flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and login logic, loading identities, handling status, and exposing login/clear functions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, content guidelines, posts, and related actor-based API calls with pagination and caching.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and custom components including moderation alert styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders an admin-only moderation interface with tabs for reviewing reported and flagged content.",
  "frontend/src/pages/FactsPage.tsx": "Displays a card of numerous human-urine-related facts.",
  "frontend/src/pages/FeedPage.tsx": "Implements the main feed with infinite posts, post creation, media uploads, moderation handling, and performance instrumentation.",
  "frontend/src/pages/GoldWaterTrackerPage.tsx": "Embeds an external water-tracking tool in a styled page layout.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero section, community description, and conditional CTA based on authentication.",
  "frontend/src/pages/LoveTheLiquidPage.tsx": "Displays a support/donation page with Ko‑fi integration and a session‑persisted thank‑you message system.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows a single post with comments, handles loading, errors, comment creation, and includes performance instrumentation.",
  "frontend/src/pages/ProfilePage.tsx": "Provides an authenticated user profile editor with fields for username, bio, preferences, and save handling.",
  "frontend/src/pages/TipsPage.tsx": "Static page listing hydration tips and urine facts in styled card sections.",
  "frontend/src/utils/ageGate.ts": "Manages age‑gate persistence in localStorage and determines whether a route is age‑restricted.",
  "frontend/src/utils/candidOption.ts": "Utility helpers for encoding optional values for Candid and checking presence.",
  "frontend/src/utils/flaggedPostsView.ts": "Utilities for working with flagged posts, including reason extraction, media checks, filtering, and timestamp sorting.",
  "frontend/src/utils/moderation.ts": "Provides helpers to detect moderation block errors, extract readable messages, and categorize error types.",
  "frontend/src/utils/perf.ts": "Implements development‑only performance marking, measuring, logging, and clearing utilities.",
  "frontend/src/utils/postImages.ts": "Validates image files, converts them to backend blobs, handles optional images, manages preview URLs, and extracts error messages.",
  "frontend/src/utils/postVideos.ts": "Validates video files, converts them to backend blobs, and manages video preview URLs.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and enabling plugins.",
  "project_state.json": "Defines project metadata, existing features, and pending requests for embedding the Quench Joy Flow site."
}