{
  "backend/main.mo": "Motoko backend actor managing profiles, posts, comments, reactions, permissions, and image validation with adult-only access enforcement.",
  "feature_evidence.json": "Feature evidence report listing performance and UX improvements with associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files, their responsibilities, and recent performance or UX optimizations.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, themes, and global background/foreground rules for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main router setup with lazy‑loaded routes, ThemeProvider, Suspense fallback, and root layout structure.",
  "frontend/src/components/age/AgeAcknowledgementGate.tsx": "Modal gate that blocks access to age‑restricted routes until the user confirms being 18+, synced with profile and localStorage.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow, cache clearing, and age‑gate reset on logout.",
  "frontend/src/components/comments/CommentItem.tsx": "Renders a comment with author info, reactions, and reporting, handling related async mutations and errors.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, navigation, mobile menu, and footer, wrapping content in profile and age gates.",
  "frontend/src/components/layout/MobileNav.tsx": "Implements a mobile slide-out navigation menu with links and login access based on authentication.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a post with content, image, reactions, comments link, and reporting, managing related async actions.",
  "frontend/src/components/profile/ProfileGate.tsx": "Forces new authenticated users to complete a profile and confirm age before using the app.",
  "frontend/src/components/reactions/ReactionBar.tsx": "Shows reaction buttons with icons and selection state, supporting pending and disabled states.",
  "frontend/src/components/state/QueryState.tsx": "Provides UI components for loading skeletons, error messages, empty states, and background refresh indicators.",
  "frontend/src/components/state/RouteChunkLoading.tsx": "Simple loading screen for lazy-loaded route chunks.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, invalidating related queries when the identity changes.",
  "frontend/src/hooks/useBackendImageUrl.ts": "Converts backend image data into a blob URL and handles cleanup when the image changes or unmounts.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns the current authenticated identity, principal, and associated user profile state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and exposing identity status.",
  "frontend/src/hooks/useQueries.ts": "Defines all backend data queries and mutations for posts, comments, profiles, and guidelines using the actor.",
  "frontend/src/index.css": "Sets global Tailwind styles and color variables for light and dark themes with custom component styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/FeedPage.tsx": "Displays the feed, handles post creation with optional images, and manages post list rendering and refresh behavior.",
  "frontend/src/pages/LandingPage.tsx": "Shows the landing page with hero section, guidelines loading, and navigation to the feed based on authentication.",
  "frontend/src/pages/PostDetailPage.tsx": "Renders the post detail page, fetching a post and its comments, and provides a form for authenticated users to submit new comments.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and allows editing of the signed-in user's profile, loading existing data and saving updates with validation and status handling.",
  "frontend/src/utils/ageGate.ts": "Manages localStorage-based age‑acknowledgement state and checks whether routes require age gating.",
  "frontend/src/utils/postImages.ts": "Validates image files, converts them to backend format, generates and revokes preview URLs, unwraps backend image objects, and extracts readable error messages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, animations, and plugins for the app's design system.",
  "project_state.json": "Describes the project’s current state, features, requirements, and known issues for the golden‑water community app."
}