{
  "backend/main.mo": "Motoko actor defining profiles, posts, comments, reactions, and moderation with access control and blob storage integration.",
  "feature_evidence.json": "Feature evidence report mapping new LoveTheLiquid page, routing, and navigation updates to corresponding files and components.",
  "frontend-file-summaries.txt": "Aggregated descriptions of major frontend files including pages, hooks, components, styling, and configuration.",
  "frontend/index.css": "Tailwind base layer with OKLCH color variables, theming tokens, and global background/foreground rules.",
  "frontend/index.html": "Basic HTML page bootstrapping the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with lazy-loaded routes, AppLayout, theme provider, and new /love-the-liquid route.",
  "frontend/src/components/admin/AuthorName.tsx": "Admin UI helper fetching usernames by principal with loading state and fallback formatting.",
  "frontend/src/components/admin/FlaggedPostsPanel.tsx": "Admin panel for viewing, filtering, sorting, and clearing automatically flagged posts.",
  "frontend/src/components/admin/ReportedCommentsPanel.tsx": "Admin panel listing reported comments with actions to clear reports or delete comments, showing loading, error, and empty states.",
  "frontend/src/components/admin/ReportedPostsPanel.tsx": "Admin interface for viewing reported posts, allowing report clearing or post deletion with status handling.",
  "frontend/src/components/age/AgeAcknowledgementGate.tsx": "Wrapper that blocks age-gated routes until the user confirms being 18+, syncing with profile and local storage.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button integrating Internet Identity, query cache clearing, and age gate reset.",
  "frontend/src/components/comments/CommentItem.tsx": "Displays a single comment with reporting, reactions, author info, error handling, and timestamps.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header navigation, mobile menu, authentication gates, and admin link handling.",
  "frontend/src/components/layout/MobileNav.tsx": "Slide-in mobile navigation menu showing links, login, and conditional admin options.",
  "frontend/src/components/moderation/ModerationAlert.tsx": "Styled alert component for displaying moderation warnings or blocked-content messages.",
  "frontend/src/components/posts/PostCard.tsx": "Renders a post card with media, reactions, reporting, deletion, and navigation to comments, using multiple backend hooks for actions and URLs.",
  "frontend/src/components/profile/ProfileGate.tsx": "Shows a required profile setup dialog for new authenticated users, allowing them to submit username, bio, and age confirmation.",
  "frontend/src/components/reactions/ReactionBar.tsx": "Displays reaction buttons with icons and pending states, calling a callback when a reaction is selected.",
  "frontend/src/components/state/QueryState.tsx": "Provides loading skeletons, error and empty state components, and a background refresh indicator for query-based UI.",
  "frontend/src/components/state/RouteChunkLoading.tsx": "Shows a centered spinner and message while async route chunks load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useBackendExternalBlobUrl.ts": "Converts an ExternalBlob video into a usable URL, preferring direct URLs and falling back to object URLs with cleanup.",
  "frontend/src/hooks/useBackendImageUrl.ts": "Generates a browser URL for an image ExternalBlob using direct or object URLs and handles cleanup.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns current user identity, authentication status, principal, and fetched profile data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and utilities for managing Internet Identity login, storage, status, and lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data such as posts, profiles, admin status, and usernames with optional auto-refresh.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes, including accent, chart, and moderation colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the main App component.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin panel with tabs for reviewing reported and flagged content, handling auth and admin access checks.",
  "frontend/src/pages/FactsPage.tsx": "Displays a card containing a long list of human-urine-related facts.",
  "frontend/src/pages/FeedPage.tsx": "Implements the main feed with post creation, media uploads, moderation handling, auto-refreshing posts, and listing posts.",
  "frontend/src/pages/LandingPage.tsx": "Shows the homepage with branding, guidelines fetch, community description, and links to join or access the feed.",
  "frontend/src/pages/LoveTheLiquidPage.tsx": "A donation page featuring Ko-fi support options, embedded widget, and reasons to contribute.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a single post with comments, including loading/error states and a form for adding new comments.",
  "frontend/src/pages/ProfilePage.tsx": "Provides a user profile editor with fields for username, bio, preferences, and admin status checks.",
  "frontend/src/pages/TipsPage.tsx": "Shows hydration tips and urine facts in a styled, card-based layout.",
  "frontend/src/utils/ageGate.ts": "Manages localStorage-based age acknowledgment and checks whether routes require age gating.",
  "frontend/src/utils/flaggedPostsView.ts": "Utility functions for handling flagged posts, media checks, and sorting/filtering operations.",
  "frontend/src/utils/moderation.ts": "Parses and categorizes moderation-related backend errors and normalizes displayed messages.",
  "frontend/src/utils/postImages.ts": "Handles image validation, conversion to backend format, preview URLs, and error extraction for uploads.",
  "frontend/src/utils/postVideos.ts": "Provides functions to validate video files, convert them to ExternalBlob format, and manage preview URLs.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, fonts, animations, and container settings with plugins.",
  "project_state.json": "JSON metadata describing project state, features, and requirements for the \"LOVE THE LIQUID\" monetization page."
}