{
  "backend/main.mo": "Motoko canister handling profiles, posts, comments, reactions, and moderation with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing added Facts page, routing, and navigation updates across frontend files.",
  "frontend-file-summaries.txt": "Text file containing summaries of numerous frontend source files and their roles in the app.",
  "frontend/index.css": "Tailwind base stylesheet defining color tokens, themes, and global element styling.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main router setup using TanStack Router with lazy-loaded pages including new Facts route.",
  "frontend/src/components/admin/AuthorName.tsx": "Displays a username for a principal or a shortened fallback when loading or missing.",
  "frontend/src/components/admin/FlaggedPostsPanel.tsx": "Admin panel listing flagged posts with filtering, sorting, and flag-clearing actions.",
  "frontend/src/components/admin/ReportedCommentsPanel.tsx": "Admin panel listing reported comments with actions to clear reports or delete comments and handling loading, empty, and error states.",
  "frontend/src/components/admin/ReportedPostsPanel.tsx": "Admin interface for viewing reported posts, allowing clearing reports or deleting posts with full UI state handling.",
  "frontend/src/components/age/AgeAcknowledgementGate.tsx": "Age gate wrapper that blocks access to adult routes until the user confirms they are 18+.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button integrating Internet Identity, query cache clearing, and age-gate reset.",
  "frontend/src/components/comments/CommentItem.tsx": "Renders an individual comment with reporting, reactions, errors, and basic author/timestamp display.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation, mobile menu, profile and age gates, and global structure.",
  "frontend/src/components/layout/MobileNav.tsx": "Mobile navigation drawer showing links based on authentication and admin status with a close-able sheet UI.",
  "frontend/src/components/moderation/ModerationAlert.tsx": "Re-usable moderation alert component displaying a warning message with consistent styling.",
  "frontend/src/components/posts/PostCard.tsx": "Renders a post card with author info, media, reactions, reporting, deleting, and navigation to comments using various backend hooks.",
  "frontend/src/components/profile/ProfileGate.tsx": "Shows a mandatory profile setup dialog for new authenticated users, allowing username, bio, and age confirmation before continuing.",
  "frontend/src/components/reactions/ReactionBar.tsx": "Displays reaction buttons with icons and handles selection, pending states, and click callbacks.",
  "frontend/src/components/state/QueryState.tsx": "Provides UI components for loading skeletons, error messages, empty states, and background refresh indicators.",
  "frontend/src/components/state/RouteChunkLoading.tsx": "Shows a centered spinner and message while route-based chunks are loading.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendExternalBlobUrl.ts": "Generates a safe URL for external video blobs using direct URLs or object URLs with cleanup.",
  "frontend/src/hooks/useBackendImageUrl.ts": "Converts image blobs to direct or object URLs and handles URL cleanup on updates.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns current user identity state and their fetched profile information.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating backend data such as posts, profiles, usernames, and admin status.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes, layout, and moderation alert styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin panel with access checks and tabs for reviewing reported and flagged content.",
  "frontend/src/pages/FactsPage.tsx": "Displays a long list of urine-related facts inside a simple card layout.",
  "frontend/src/pages/FeedPage.tsx": "Implements the main feed with post creation, media uploads, moderation handling, and real-time post refreshing.",
  "frontend/src/pages/LandingPage.tsx": "Shows the landing page with branding, guidelines, and calls to action for joining or accessing the feed.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a single post with its comments, handles loading/error states, and allows authenticated users to submit new comments.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits the current user's profile, managing form state, validation, and save operations with success/error feedback.",
  "frontend/src/pages/TipsPage.tsx": "Renders hydration tips and urine-related facts as static lists within styled cards.",
  "frontend/src/utils/ageGate.ts": "Manages age‑gate acknowledgement via localStorage and determines which routes require age confirmation.",
  "frontend/src/utils/flaggedPostsView.ts": "Provides helpers for analyzing flagged posts, including flag reason extraction, media checks, and timestamp sorting.",
  "frontend/src/utils/moderation.ts": "Normalizes backend moderation errors, detects moderation blocks, and categorizes error messages.",
  "frontend/src/utils/postImages.ts": "Validates image uploads, converts images to backend blobs, generates preview URLs, and extracts backend error messages.",
  "frontend/src/utils/postVideos.ts": "Validates video uploads, converts videos to backend blobs, and handles preview URL creation and cleanup.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL and hash parameters and persisting them in sessionStorage, plus utilities for clearing stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Tracks project metadata, existing features, pending feature requests, and known issues for the app’s build state."
}