{
  "backend/main.mo": "Motoko canister implementing profiles, posts, comments, reactions, and moderation with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping new Tips page routing, UI, navigation, and theming to modified frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend source files across pages, hooks, components, and config.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and global UI tokens.",
  "frontend/index.html": "HTML entry point providing root element and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes including the new /tips page, uses Suspense and ThemeProvider for layout and theming.",
  "frontend/src/components/admin/AuthorName.tsx": "Fetches and displays a username for a principal with fallback to a shortened principal string.",
  "frontend/src/components/admin/FlaggedPostsPanel.tsx": "Admin panel listing flagged posts with filtering, sorting, and actions to clear flags using query hooks.",
  "frontend/src/components/admin/ReportedCommentsPanel.tsx": "Admin panel listing reported comments with actions to clear reports or delete comments.",
  "frontend/src/components/admin/ReportedPostsPanel.tsx": "Admin panel displaying reported posts and allowing report clearing or post deletion.",
  "frontend/src/components/age/AgeAcknowledgementGate.tsx": "Modal gate requiring users to confirm they are 18+ before accessing age‑restricted routes.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth, query cache clearing, and age‑gate reset.",
  "frontend/src/components/comments/CommentItem.tsx": "Renders a comment with reporting and reaction actions, showing errors and metadata.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, authentication gates, and mobile menu handling.",
  "frontend/src/components/layout/MobileNav.tsx": "Slide‑out mobile navigation menu with links based on authentication and admin status.",
  "frontend/src/components/moderation/ModerationAlert.tsx": "Styled alert component for displaying moderation‑related warning messages.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a post card with author info, media, reactions, reporting, and deletion actions using various hooks and UI components.",
  "frontend/src/components/profile/ProfileGate.tsx": "Shows a mandatory profile setup dialog for new authenticated users and saves username, bio, and age confirmation.",
  "frontend/src/components/reactions/ReactionBar.tsx": "Renders reaction buttons with icons, highlighting the selected reaction and handling pending states.",
  "frontend/src/components/state/QueryState.tsx": "Provides loading skeletons, error display, empty state, and refresh indicators for query-driven UI.",
  "frontend/src/components/state/RouteChunkLoading.tsx": "Shows a centered spinner and message while lazy-loaded route chunks are loading.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendExternalBlobUrl.ts": "Converts a backend ExternalBlob for video into a usable URL, preferring direct URLs and managing object URL cleanup.",
  "frontend/src/hooks/useBackendImageUrl.ts": "Generates a URL for image blobs from the backend, using direct URLs or blob URLs with cleanup.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns identity and authentication state along with the caller’s user profile query results.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating posts, profiles, admin status, usernames, and auto-refreshing post lists through an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables for light/dark modes, and custom utility classes including gradients and moderation alert styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders admin-only moderation tools, handling authentication and admin checks before showing reported and flagged content panels.",
  "frontend/src/pages/FeedPage.tsx": "Displays the post feed with auto-refresh, post creation UI, media validation, moderation error handling, and memoized post rendering.",
  "frontend/src/pages/LandingPage.tsx": "Shows the public landing page with hero content, authentication-aware CTA, and optional content guidelines.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows a single post with its comments, allows authenticated users to add comments, and handles loading and error states.",
  "frontend/src/pages/ProfilePage.tsx": "React page for viewing and editing the current user's profile with fields, save logic, and authentication/loader states.",
  "frontend/src/pages/TipsPage.tsx": "Static hydration‑tips page displaying a list of daily water‑intake suggestions.",
  "frontend/src/utils/ageGate.ts": "LocalStorage‑based age‑acknowledgement utilities and route gating checks.",
  "frontend/src/utils/flaggedPostsView.ts": "Helpers for flagged post handling, including reason extraction, media checks, and sorting/filtering utilities.",
  "frontend/src/utils/moderation.ts": "Utility functions for detecting moderation‑block errors, extracting readable messages, and categorizing error types.",
  "frontend/src/utils/postImages.ts": "Image upload utilities including validation, conversion to backend blobs, preview URL management, and error extraction.",
  "frontend/src/utils/postVideos.ts": "Video upload utilities for validation, backend‑format conversion, and preview URL creation and cleanup.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session‑stored parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Defines the project state for adding a dedicated Tips page, listing existing features, a new feature request, and meta info like schema and project version."
}