{
  "backend/main.mo": "Motoko canister implementing profiles, posts, comments, reactions, and permission-checked CRUD operations with image size validation.",
  "feature_evidence.json": "Lists feature evidence linking UI username display updates and a React Query username hook to specific files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including hooks, components, pages, and utilities.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH theme variables for light and dark modes with global styling tokens.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with lazy‑loaded pages, routing tree, theme provider, and layout wrapper.",
  "frontend/src/components/age/AgeAcknowledgementGate.tsx": "Modal gate enforcing 18+ confirmation on protected routes with profile sync and navigation handling.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button integrating Internet Identity auth, query cache clearing, and age‑acknowledgement reset.",
  "frontend/src/components/comments/CommentItem.tsx": "Displays a single comment with reactions, reporting, author check, and error handling wrapped in a memoized component.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper providing header, footer, navigation, and gating via profile and age checks.",
  "frontend/src/components/layout/MobileNav.tsx": "Slide-in mobile navigation menu showing links and login controls based on auth state.",
  "frontend/src/components/posts/PostCard.tsx": "Displays an individual post with image, reactions, reporting, deletion, and navigation to comments.",
  "frontend/src/components/profile/ProfileGate.tsx": "Forces authenticated users without a profile to complete a setup dialog before accessing the app.",
  "frontend/src/components/reactions/ReactionBar.tsx": "Reaction button bar allowing selection of emoji-style reactions with loading and error states.",
  "frontend/src/components/state/QueryState.tsx": "Reusable components for loading skeletons, error states, empty states, and background refresh indicators.",
  "frontend/src/components/state/RouteChunkLoading.tsx": "Full‑page loader shown while route-level code chunks are loading.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBackendImageUrl.ts": "Converts backend image data to a blob URL and cleans it up to prevent memory leaks.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns current user identity, auth status, and loaded profile information.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as posts, profiles, comments, and admin status.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark mode, plus custom utility classes like hero gradients.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/FeedPage.tsx": "Implements the main feed with post listing, auto-refresh, post creation with image upload, and related UI states.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero section, community intro, and links to join or access the feed.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a single post with its comments, supports adding new comments, and handles loading and error states.",
  "frontend/src/pages/ProfilePage.tsx": "React page that loads, displays, and updates the current user's profile with form fields and admin checks.",
  "frontend/src/utils/ageGate.ts": "Utilities for storing and checking age‑gate acknowledgement and determining whether a route is age‑gated.",
  "frontend/src/utils/postImages.ts": "Image validation and conversion helpers for uploads, including backend format conversion and error extraction.",
  "frontend/src/utils/urlParams.ts": "Functions for reading, persisting, and clearing URL parameters using both URL and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings.",
  "project_state.json": "JSON file describing project state, features, and pending feature requests for showing usernames on the community feed."
}