{
  "kind": "build_request",
  "title": "Show post author username on the Community Feed",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend query method that lets any authenticated user resolve a post author principal to a public display name (username), so the frontend can show usernames on the Community Feed without requiring admin permissions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make sure the username appears on the community feed."
        ]
      },
      "acceptanceCriteria": [
        "A new query endpoint exists on the main actor (backend/main.mo) that accepts a user Principal and returns the user's username (or null/empty when no profile exists).",
        "The endpoint is callable by users with #user permission (i.e., it does not require the caller to be the same principal and does not require admin).",
        "Existing endpoints and authorization rules for private profile access (e.g., getUserProfile) remain unchanged."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Community Feed post UI to display the author's username (from the profile) instead of the truncated principal string currently shown in each post header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make sure the username appears on the community feed."
        ]
      },
      "acceptanceCriteria": [
        "In the feed post list (frontend/src/pages/FeedPage.tsx using frontend/src/components/posts/PostCard.tsx), each post header shows the author's username when available.",
        "If the current user is the author, the label remains \"You\".",
        "If the username cannot be resolved (no profile or request failure), the UI falls back to the existing display format: \"User {first 8 chars of principal}...\".",
        "Username lookups are cached (via React Query) so scrolling the feed does not trigger repeated network calls for the same author principal."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a dedicated React Query hook for resolving a public username by principal, and use it in PostCard when rendering the Community Feed author line.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make sure the username appears on the community feed."
        ]
      },
      "acceptanceCriteria": [
        "A new hook is added in frontend/src/hooks/useQueries.ts to fetch a username by Principal (calling the new backend method).",
        "PostCard uses the new hook to render the display name, without changing any files under frontend/src/components/ui or other immutable paths.",
        "The feed remains functional when logged in and viewing posts, with no new console errors caused by the username lookup."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with logic in backend/main.mo.",
    "Do not edit immutable frontend paths listed in SYSTEM_CONTEXT (compose existing UI components instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change how comments display author identity (unless separately requested).",
    "Do not implement third-party auth or identity providers beyond Internet Identity.",
    "Do not redesign the feed layout beyond what is necessary to show the username."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}