{
  "kind": "build_request",
  "title": "Add a new Facts page with urine facts",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new public \"Facts\" page that displays the provided human urine facts as a readable, styled list (English text), consistent with the existing Tailwind + shadcn Card styling used on the Tips page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-last"
        ],
        "quotes": [
          "ADD A FACTS PAGE"
        ]
      },
      "acceptanceCriteria": [
        "A new page component exists at frontend/src/pages/FactsPage.tsx (or equivalent in the existing pages folder) and renders without runtime errors.",
        "The page has a clear H1 title (e.g., \"Facts\" or \"Human Urine Facts\") and shows a numbered or bulleted list of urine facts.",
        "The styling is consistent with existing app pages (e.g., container widths, Card usage, typography, spacing).",
        "All displayed facts are in English and are human-urine-related (no unrelated content)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add routing for the new Facts page at path \"/facts\" using the existing TanStack Router pattern in frontend/src/App.tsx (lazy-loaded like other pages).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-last"
        ],
        "quotes": [
          "ADD A FACTS PAGE"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /facts in the browser renders the new Facts page.",
        "The Facts page is included in the router tree similarly to /tips (lazy-loaded and wrapped by the existing AppLayout)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add navigation entry for the new Facts page to both the desktop header navigation (frontend/src/components/layout/AppLayout.tsx) and the mobile menu (frontend/src/components/layout/MobileNav.tsx).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-last"
        ],
        "quotes": [
          "ADD A FACTS PAGE"
        ]
      },
      "acceptanceCriteria": [
        "Desktop nav includes a \"Facts\" link that navigates to /facts.",
        "Mobile nav includes a \"Facts\" link that navigates to /facts and closes the sheet on click.",
        "The new link is visible to unauthenticated users (same visibility level as the existing Tips link)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only shadcn components).",
    "Keep backend unchanged unless strictly required for the Facts page (this feature should be frontend-only/static content)."
  ],
  "nonGoals": [
    "Do not add or modify backend canister APIs for this change.",
    "Do not implement search, filtering, or CMS-style editing for facts unless explicitly requested.",
    "Do not change existing Tips page content beyond what is necessary for navigation consistency."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}