{
  "kind": "build_request",
  "title": "Optimize Website Performance (Frontend + Backend)",
  "projectName": "LOVE THE LIQUID",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Reduce frontend load time and runtime re-rendering by optimizing React component rendering in high-traffic views (especially the feed) and ensuring expensive computations are memoized and/or moved out of render paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PERFORMANCE",
          "ALL",
          "BULID IT"
        ]
      },
      "acceptanceCriteria": [
        "Typing in the Feed post composer does not trigger re-rendering of the entire post list (confirm via React DevTools profiler: post list components remain stable while typing).",
        "Any list sorting/filtering that currently runs on every render is memoized and only recomputes when its inputs change.",
        "No unnecessary object URL creation/revocation loops occur during normal navigation and posting flows."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Optimize React Query usage to reduce unnecessary network calls and UI blocking by tuning caching, refetch behavior, and invalidation patterns for posts, comments, admin views, and guidelines.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PERFORMANCE",
          "ALL"
        ]
      },
      "acceptanceCriteria": [
        "Posts auto-refresh (currently enabled via query invalidation interval) does not refetch more frequently than necessary and does not refetch while the app is not visible (e.g., when the tab is hidden).",
        "Queries that are unlikely to change frequently (e.g., content guidelines) retain long stale times and do not refetch on window focus (verify network panel shows no repeated guideline fetches during routine navigation).",
        "Mutations invalidate only the minimal required query keys (e.g., creating a comment invalidates that post’s comment query rather than all comments)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve feed scalability by adding backend-supported pagination (or windowed retrieval) for posts and updating the frontend to request posts in pages instead of always calling the full post list endpoint.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PERFORMANCE",
          "ALL"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a paginated posts query (e.g., accepts page size and cursor/offset) that returns a stable ordering and enough information to request the next page.",
        "Frontend feed loads an initial page quickly and provides a way to fetch additional pages (infinite scroll or “Load more”).",
        "Existing behavior remains correct: newly created posts appear without requiring a full refetch of all historical posts."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Improve backend responsiveness for read-heavy operations by reducing avoidable full-map scans and repeated work in common read paths (posts, comments, admin moderation views).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PERFORMANCE",
          "ALL"
        ]
      },
      "acceptanceCriteria": [
        "Common read endpoints used by the feed and post detail views complete without scanning all stored items when pagination/cursors are provided.",
        "Admin moderation views avoid N+1 query patterns where possible (e.g., avoid fetching each post individually when building flagged/reported lists).",
        "No changes break existing access control checks (unauthorized callers still trap/are rejected as before)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add lightweight performance instrumentation and sanity checks for key flows (initial load, loading feed, loading post detail, creating a post) so performance improvements can be verified during development.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "PERFORMANCE",
          "ALL"
        ]
      },
      "acceptanceCriteria": [
        "Frontend includes simple timing logs (development-only) around initial route render and key data fetch completion (feed/posts and post detail/comments).",
        "Backend includes minimal logging (where appropriate) or structured code organization to make hot paths identifiable without adding heavy overhead.",
        "No user-facing text includes debug/perf output in production builds."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn/ui) directly; compose them instead.",
    "Do not edit immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services or external databases.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new product features unrelated to performance optimization (e.g., new social features, new monetization flows, new AI assistant behavior).",
    "Do not integrate third-party analytics, APM tools, or external monitoring services.",
    "Do not redesign the visual theme unless required for a performance fix (keep UI changes minimal and performance-driven)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}