{
  "kind": "build_request",
  "title": "Add dedicated Tips page with drinking-water tips",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new dedicated Tips page route at \"/tips\" and add it to the TanStack Router route tree so it is accessible as a normal page in the SPA.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "Great — selecting option 2 means you want the drinking‑water tips placed on a new dedicated Tips page.",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /tips renders a Tips page without errors.",
        "The page is code-split (lazy-loaded) consistently with other non-landing pages (e.g., FeedPage).",
        "The new route is included in the router's routeTree (frontend/src/App.tsx)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement the Tips page UI containing the drinking-water tips content as a readable, responsive layout using existing UI components and Tailwind styling, with all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "drinking water tips",
          "add them to the website",
          "2"
        ]
      },
      "acceptanceCriteria": [
        "The Tips page displays the following tips as a list:\n- Drink when you feel thirsty.\n- Keep a reusable water bottle with you.\n- Start your day with a glass of water.\n- Add lemon, cucumber or berries for flavor.\n- Choose water over sugary drinks.\n- Eat water‑rich foods like melon or cucumbers.\n- Aim for pale‑yellow urine as a hydration guide.\n- Sip water during meals.\n- Set small reminders if you forget to drink.",
        "The page has a clear page title (e.g., \"Hydration Tips\") and uses consistent spacing/typography with the rest of the site.",
        "The page renders well on mobile and desktop widths (no horizontal overflow; text remains legible)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add navigation access to the Tips page from the app’s header navigation (desktop) and mobile menu so users can reach \"/tips\" easily.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "add them to the website",
          "2"
        ]
      },
      "acceptanceCriteria": [
        "A \"Tips\" link is visible in the desktop navigation and navigates to /tips.",
        "A \"Tips\" link is visible in the mobile navigation drawer and navigates to /tips, closing the drawer after navigation.",
        "The Tips link does not require authentication (it is available regardless of login state)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply a cohesive visual theme for the new Tips page that matches the existing site’s warm “Golden Water” aesthetic (warm gold/amber neutrals), and keep styling consistent with the current layout components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "The Tips page uses the existing design system primitives (Tailwind + existing UI components) and does not introduce a conflicting color palette.",
        "The page looks visually integrated with the current LandingPage/AppLayout styling (cards, typography, spacing, and background treatments align)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose existing UI components only).",
    "Do not modify immutable hook/bootstrap files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep all changes within the existing single-SPA TanStack Router architecture; no new backend services."
  ],
  "nonGoals": [
    "Do not add third-party integrations, analytics, or external CMS for tips content.",
    "Do not add user-generated tips, commenting, liking, or admin management for tips (static content only).",
    "Do not change age-gating behavior for existing gated routes (/feed, /profile, /post/:postId)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}