{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dedicated Tips page (drinking-water tips) with navigation access",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a new lazy-loaded /tips route and register it in the TanStack Router route tree.",
      "acceptanceCriteria": [
        "Navigating to /tips renders a Tips page without errors.",
        "The page is code-split (lazy-loaded) consistently with other non-landing pages (e.g., FeedPage).",
        "The new route is included in the router's routeTree (frontend/src/App.tsx)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new \"/tips\" route in the TanStack Router routeTree, using React.lazy + Suspense like other non-landing pages to ensure consistent code-splitting behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement a readable, responsive Tips page UI that displays the provided hydration tips in English using existing UI components and Tailwind styling.",
      "acceptanceCriteria": [
        "The Tips page displays the following tips as a list:\n- Drink when you feel thirsty.\n- Keep a reusable water bottle with you.\n- Start your day with a glass of water.\n- Add lemon, cucumber or berries for flavor.\n- Choose water over sugary drinks.\n- Eat water‑rich foods like melon or cucumbers.\n- Aim for pale‑yellow urine as a hydration guide.\n- Sip water during meals.\n- Set small reminders if you forget to drink.",
        "The page has a clear page title (e.g., \"Hydration Tips\") and uses consistent spacing/typography with the rest of the site.",
        "The page renders well on mobile and desktop widths (no horizontal overflow; text remains legible)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TipsPage.tsx",
          "operation": "create",
          "description": "Create the Tips page view with an English title (e.g., \"Hydration Tips\") and a responsive layout that renders the provided tips as a readable list using existing UI components (e.g., Card) and Tailwind utility classes (no changes to frontend/src/components/ui)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add public navigation links to /tips in both the desktop header navigation and the mobile navigation drawer.",
      "acceptanceCriteria": [
        "A \"Tips\" link is visible in the desktop navigation and navigates to /tips.",
        "A \"Tips\" link is visible in the mobile navigation drawer and navigates to /tips, closing the drawer after navigation.",
        "The Tips link does not require authentication (it is available regardless of login state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a \"Tips\" Link to the desktop header navigation that is always visible (not gated by authentication/admin state) and routes to \"/tips\"."
        },
        {
          "path": "frontend/src/components/layout/MobileNav.tsx",
          "operation": "modify",
          "description": "Add a \"Tips\" Link to the mobile navigation drawer that is always visible (not gated by authentication/admin state) and calls onClose on click so the drawer closes after navigating to \"/tips\"."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Style the Tips page to match the existing warm “Golden Water” aesthetic using existing Tailwind theme tokens and layout patterns.",
      "acceptanceCriteria": [
        "The Tips page uses the existing design system primitives (Tailwind + existing UI components) and does not introduce a conflicting color palette.",
        "The page looks visually integrated with the current LandingPage/AppLayout styling (cards, typography, spacing, and background treatments align)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TipsPage.tsx",
          "operation": "modify",
          "description": "Refine Tips page styling to align with the existing Golden Water theme (use existing Tailwind theme tokens/classes such as background/card/muted/primary, consistent container widths, spacing, and typography), keeping the page visually consistent with AppLayout/LandingPage patterns."
        }
      ]
    }
  ]
}