{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Facts page and navigation (/facts)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a new public Facts page that renders a readable, styled list of human urine facts consistent with existing Tailwind + shadcn Card styling used on the Tips page.",
      "acceptanceCriteria": [
        "A new page component exists at frontend/src/pages/FactsPage.tsx (or equivalent in the existing pages folder) and renders without runtime errors.",
        "The page has a clear H1 title (e.g., \"Facts\" or \"Human Urine Facts\") and shows a numbered or bulleted list of urine facts.",
        "The styling is consistent with existing app pages (e.g., container widths, Card usage, typography, spacing).",
        "All displayed facts are in English and are human-urine-related (no unrelated content)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FactsPage.tsx",
          "operation": "create",
          "description": "Add a new Facts page component that displays a static English list of human-urine-related facts, using the same Tailwind layout patterns and the shadcn Card components (imported from the existing ui layer) consistent with TipsPage. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a lazy-loaded TanStack Router route for the Facts page at /facts, included in the router tree and wrapped by the existing AppLayout.",
      "acceptanceCriteria": [
        "Visiting /facts in the browser renders the new Facts page.",
        "The Facts page is included in the router tree similarly to /tips (lazy-loaded and wrapped by the existing AppLayout)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new lazy-loaded Facts page route at path \"/facts\" using the same TanStack Router pattern as the existing Tips route (lazy import, createRoute, and inclusion in the route tree)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add Facts link to desktop header navigation and mobile menu, visible to unauthenticated users, matching existing Tips link visibility and behavior.",
      "acceptanceCriteria": [
        "Desktop nav includes a \"Facts\" link that navigates to /facts.",
        "Mobile nav includes a \"Facts\" link that navigates to /facts and closes the sheet on click.",
        "The new link is visible to unauthenticated users (same visibility level as the existing Tips link)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a new \"Facts\" Link in the desktop navigation alongside the existing public links (e.g., near \"Tips\"), ensuring it is visible regardless of authentication state and routes to \"/facts\"."
        },
        {
          "path": "frontend/src/components/layout/MobileNav.tsx",
          "operation": "modify",
          "description": "Add a new \"Facts\" Link in the mobile navigation alongside the existing public links (e.g., near \"Tips\"), ensuring it routes to \"/facts\" and calls onClose to close the sheet on click."
        }
      ]
    }
  ]
}