{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Show post author username on the Community Feed (frontend)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Display each post author's username on the Community Feed post header, with correct fallbacks and caching.",
      "acceptanceCriteria": [
        "In the feed post list (frontend/src/pages/FeedPage.tsx using frontend/src/components/posts/PostCard.tsx), each post header shows the author's username when available.",
        "If the current user is the author, the label remains \"You\".",
        "If the username cannot be resolved (no profile or request failure), the UI falls back to the existing display format: \"User {first 8 chars of principal}...\".",
        "Username lookups are cached (via React Query) so scrolling the feed does not trigger repeated network calls for the same author principal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/posts/PostCard.tsx",
          "operation": "modify",
          "description": "Replace the current truncated-principal author label with a username-aware label: keep \"You\" when the viewer is the author, otherwise use the new React Query username-resolver hook to render the author's username when available, and fall back to the existing \"User {first 8 chars}...\" format when missing or on failure. Ensure rendering remains stable while the lookup is loading (e.g., show fallback until username resolves) and does not introduce new console errors. Use the existing authenticated actor pattern provided by the authorization component (Internet Identity + actor via hooks) to support authenticated calls; Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a dedicated React Query hook to resolve a public username by principal and use it from PostCard.",
      "acceptanceCriteria": [
        "A new hook is added in frontend/src/hooks/useQueries.ts to fetch a username by Principal (calling the new backend method).",
        "PostCard uses the new hook to render the display name, without changing any files under frontend/src/components/ui or other immutable paths.",
        "The feed remains functional when logged in and viewing posts, with no new console errors caused by the username lookup."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook (e.g., useGetUsernameFromPrincipal) that accepts an author Principal (or its string form), calls the backend actor capability getUsernameFromPrincipal, and caches results by a stable queryKey (e.g., ['username', principalText]). Configure it to avoid repeated calls during feed scrolling (reasonable staleTime/cacheTime) and to handle missing actor/auth gracefully (disabled until actor available; on failure return null via query error handling so the UI can fall back). This hook should use the existing actor plumbing from core-infrastructure/useActor and the app's authorization flow; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/posts/PostCard.tsx",
          "operation": "modify",
          "description": "Wire PostCard to import and use the new username-resolver hook from frontend/src/hooks/useQueries.ts when rendering the author line (skipping the lookup when isAuthor is true). Keep all changes within PostCard (do not modify frontend/src/components/ui/*). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}