{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add public \"LOVE THE LIQUID\" Ko-fi monetization page",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Create a new public \"LOVE THE LIQUID\" page with a prominent title and embedded Ko-fi view.",
      "acceptanceCriteria": [
        "A new React page component exists for the monetization page and renders a visible H1 title \"LOVE THE LIQUID\".",
        "The page embeds the Ko-fi destination https://ko-fi.com/painparadise directly within the page content (e.g., via iframe/embed), and the embed loads without crashing the app.",
        "The page is accessible without requiring authentication (consistent with existing public pages like Tips/Facts)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoveTheLiquidPage.tsx",
          "operation": "create",
          "description": "Create a new public page component rendering an H1 \"LOVE THE LIQUID\" and an embedded view of https://ko-fi.com/painparadise (e.g., responsive iframe with safe sandbox/referrer policy). Use existing shadcn-ui components (e.g., Card) to match app styling—Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add a clear call-to-action button on the \"LOVE THE LIQUID\" page linking to Ko-fi.",
      "acceptanceCriteria": [
        "A button is visible on the \"LOVE THE LIQUID\" page and uses English user-facing text.",
        "Clicking the button opens https://ko-fi.com/painparadise (preferably in a new tab using safe link attributes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoveTheLiquidPage.tsx",
          "operation": "modify",
          "description": "Add a prominent call-to-action button with English text that links to https://ko-fi.com/painparadise and opens in a new tab with safe rel attributes. Compose using the existing shadcn-ui Button component—Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Register a lazy-loaded TanStack Router route for the new \"LOVE THE LIQUID\" page at a stable path.",
      "acceptanceCriteria": [
        "Navigating directly to the new route path renders the \"LOVE THE LIQUID\" page.",
        "The new page is lazy-loaded similarly to existing routes (e.g., Tips/Facts) and does not increase initial bundle unnecessarily."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a lazy import for LoveTheLiquidPage and register a new TanStack Router route at a stable, human-readable path like \"/love-the-liquid\", included in the routeTree alongside existing lazy-loaded pages."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add navigation links to the \"LOVE THE LIQUID\" page in both desktop header nav and mobile menu.",
      "acceptanceCriteria": [
        "Desktop header shows a nav link that routes to the \"LOVE THE LIQUID\" page.",
        "Mobile menu shows a nav link that routes to the \"LOVE THE LIQUID\" page and closes the menu when clicked."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a new desktop header navigation <Link> entry labeled \"LOVE THE LIQUID\" pointing to \"/love-the-liquid\" and keep it visible for unauthenticated users (like Tips/Facts)."
        },
        {
          "path": "frontend/src/components/layout/MobileNav.tsx",
          "operation": "modify",
          "description": "Add a new mobile menu <Link> entry labeled \"LOVE THE LIQUID\" pointing to \"/love-the-liquid\" and ensure it calls onClose when clicked (consistent with other mobile links)."
        }
      ]
    }
  ]
}